package ru.avalon.java.dev.j10.labs;

import java.util.Comparator;
import java.util.Random;


public class Main {
    
    private static void printStrArr(String[] array){
        System.out.println("Random String Array :" );
        for (String arr: array){
        System.out.print(arr+" ");
        }
        System.out.println();
        }
    
    private static String getStr () {
        char[] chars = "AbcdEfghIjklmnOpqrstUvwxYz".toCharArray();
        StringBuilder sb = new StringBuilder(10);
        Random rnd = new Random();
        String strSB="";
        for (int i = 0; i < 10; i++) { 
            char ch = chars[rnd.nextInt(chars.length)]; 
            sb.append(ch);
            strSB=sb.toString();
                }
        return strSB;
    }
    
    public static void main(String[] args) {
        /*
         * TODO(Студент): Проинициализируйте массив strings
         *
         * Массив слелдует проинициализировать таким образом,
         * чтобы он содержал 20 строк, расположенных не
         * по порядку.
         */
        
        
       	    String[] strings = new String[20];
            for (int i=0; i<strings.length; i++) {
             strings[i]=getStr();
             }
            printStrArr(strings);
           
            }

	    /*
	     * TODO(Студент): Проинициализируйте массив persons
	     *
	     * 1. Создайте класс, реализующий интерфейс Person.
	     *
	     * 2. Проинициализируйте массив persons 20
	     *    экземплярыми созданного класса.
	     */
	    Person[] persons = new Person[20];
            

        /*
         * TODO(Студент): Проинициализируйте переменную sort
         *
         * 1. Создайте класс, реализующий интерфейс Sort
         *
         * 2. Проинициализируйте переменную sort экземпляром
         *    созданного класса.
         */
        Sort sort = new Sorting();

        /*
         * TODO(Студент): Проинициализируйте переменную comparator
         *
         * 1. Создайте класс, реализующий интерфейс Comparator.
         *    Подумайте о контексте, в котором будет
         *    использоваться экземпляр.
         *
         * 2. Проинициализируйте переменную comparator
         *    экземпляром созданного класса.
         */
        Comparator comparator = null;

        /*
         * TODO(Студент): Отсортируйте массив persons по возрастанию
         *
         * 1. Если всё сделано правильно, предложенный вызов
         *    метода sort должен отсортировать массив по
         *    возрастанию.
         *
         * 2. С использованием отладчика убедитесь в том,
         *    что массив отсортирован по возрастанию.
         */
       // sort.sort(persons);

        /*
         * TODO(Студент): Отсортируйте массив strings по возрастанию
         *
         * 1. Если всё сделано правильно, предложенный вызов
         *    метода sort должен отсортировать массив по
         *    возрастанию.
         *
         * 2. С использованием отладчика убедитесь в том,
         *    что массив отсортирован по возрастанию.
         */
       // sort.sort(strings);

        /*
         * TODO(Студент): Отсортируйте массив strings по убыванию
         *
         * 1. Подумайте о том, какой Comparator следует
         *    передать, чтобы массив сортировался по убыванию.
         *
         * 2. С использованием отладчика убедитесь в том,
         *    что массив отсортирован по убыванию.
         */
       // sort.sort(strings, comparator);
    }

